// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Hindi (`hi`).
class AppLocalizationsHi extends AppLocalizations {
  AppLocalizationsHi([String locale = 'hi']) : super(locale);

  @override
  String get name => 'जोनाथन साइमन';

  @override
  String get roleLarge => 'सॉफ्टवेयर डेवलपर | टेक एन्थुसियास्ट';

  @override
  String get roleSmall => 'सॉफ्टवेयर डेवलपर';

  @override
  String get phrase =>
      'मेरे डिजिटल गार्डन 🌱 में आपका स्वागत है, एक ऐसी जगह जहाँ मैं उत्कृष्ट उत्पादों के विकास के बारे में अपनी खोजों को संवारता और साझा करता हूँ, लगातार खुद को एक डेवलपर के रूप में परिष्कृत करता हूँ, और तकनीक की विशाल दुनिया में अपने करियर को विकसित करता हूँ।';

  @override
  String get contactButtonLabel => 'संपर्क करें';

  @override
  String get expirienceTitle => 'अनुभव';

  @override
  String get projectsTitle => 'परियोजनाएं';

  @override
  String get technologiesTitle => 'तकनीकें जिनके साथ मैंने काम किया है';

  @override
  String get contactTitle => 'मुझसे संपर्क करें';

  @override
  String get cotizameName => 'कोटिज़मे';

  @override
  String get cotizameRole => 'मोबाइल डेवलपर (फ्लटर)';

  @override
  String get cotizameTimelapse => '2023 - वर्तमान';

  @override
  String get cotizameExperienceDescription =>
      '\"कोटिज़मे\" के विकास में, एक नवीन मोबाइल एप्लिकेशन जो खरीदारों और विक्रेताओं के बीच सीधे कोटेशन अनुरोधों के माध्यम से इंटरेक्शन को सुविधाजनक बनाता है, मैंने उपयोगकर्ता इंटरफेस और डिज़ाइन के निर्माण का नेतृत्व किया, फ्लटर का उपयोग करते हुए। मेरी भूमिका एक सहज उपयोगकर्ता अनुभव की अवधारणा और कार्यान्वयन में मौलिक है, जो एप्लिकेशन के विशिष्ट चरित्र और उपयोगिता में काफी योगदान देती है। यह परियोजना फ्लटर और डार्ट में गहराई से उतरने का एक उत्कृष्ट अवसर रही है, इंटरफेस डिज़ाइन और सहयोग में मेरे कौशल को मजबूत करते हुए एक क्रांतिकारी बाज़ार समाधान देने के लिए।';

  @override
  String get cotizameProjectDescription =>
      'कोटिज़मे एक नवीन मोबाइल एप्लिकेशन है जिसे फ्लटर में डिज़ाइन किया गया है, विशेष रूप से लेकिन विशेष रूप से नहीं, डोमिनिकन गणराज्य की आबादी के लिए। कोटिज़मे खरीदारों और विक्रेताओं के बीच बातचीत के तरीके को क्रांतिकारी बनाता है, खरीदार को खरीद प्रक्रिया में अधिक सक्रिय भूमिका देता है। इस एप्लिकेशन के माध्यम से, उपयोगकर्ता विस्तृत कोटेशन अनुरोध तैयार कर सकते हैं जिसमें वांछित उत्पाद या सेवा और वे भुगतान करने को तैयार हैं उस कीमत को निर्दिष्ट करते हैं। ये अनुरोध सीधे चयनित विक्रेताओं को भेजे जाते हैं, जो व्यक्तिगत प्रस्तावों के साथ प्रतिक्रिया दे सकते हैं। एक प्रस्ताव स्वीकार करने पर, एक खरीद आदेश स्वचालित रूप से उत्पन्न होता है, जिससे भुगतान और वितरण प्रक्रिया शुरू होती है। कोटिज़मे अपने आधुनिक और उपयोगकर्ता-मित्रवत इंटरफेस के लिए प्रमुख है, जो त्वरित और सुलभ मोबाइल वातावरण में कोटेशन अनुरोधों की कुशल प्रक्रिया और सहज नेविगेशन की सुविधा प्रदान करता है।';

  @override
  String get freelanceName => 'फ्रीलांस';

  @override
  String get freelanceRole => 'वेब डेवलपर / मोबाइल डेवलपर (Ionic, Flutter)';

  @override
  String get freelanceTimelapse => '2022 - 2023';

  @override
  String get freelanceExperienceDescription =>
      'व्यक्तिगत परियोजनाओं और फ्रीलांस कार्य विकास और डिज़ाइन कौशल को विस्तारित करने में महत्वपूर्ण रहे हैं, जिससे स्वतंत्र रूप से नवीन समाधानों की खोज करने की क्षमता में सुविधा मिली है। ये अनुभव परंपरागत संरचनाओं पर निर्भर नहीं करते हुए परियोजनाओं को प्रबंधित करने और तकनीकी चुनौतियों को सृजनात्मकता से हल करने की क्षमता को मजबूत करते हैं।';

  @override
  String get riveColorModifierProjectName => 'रिव कलर मॉडिफायर';

  @override
  String get riveColorModifierProjectDescription =>
      'रिव कलर मॉडिफायर एक फ्लटर पैकेज है जो आपको अपने रिव एनिमेशन के रंगों को गतिशील रूप से संशोधित करने की अनुमति देता है। यदि आप अपने एप्लिकेशन में एनिमेशन के साथ काम करते हैं, तो यह पैकेज वास्तविक समय में रंगों को समायोजित करने के लिए एक मूल्यवान उपकरण हो सकता है।\n\nपैकेज के बारे में मुख्य विवरण यहाँ दिए गए हैं:\n\n- उपयोग: रिव कलर मॉडिफायर का उपयोग करने के लिए, बस अपनी `pubspec.yaml` फाइल में निर्भरता जोड़ें। फिर, अपने कोड में, आप `RiveColorModifier` के उदाहरण बना सकते हैं और अपने रिव एनिमेशन में रंग परिवर्तन लागू कर सकते हैं।\n- लाभ:\n    1. लचीलापन: मूल रिव फाइलों को बदले बिना एनिमेशन रंगों को संशोधित करना।\n    2. इंटरएक्टिविटी: वास्तविक समय में रंगों को समायोजित करना, अनुकूलनीय थीम या गतिशील एनिमेशन के लिए उपयोगी।\n    3. अनुकूलन: बस रंग बदलने के लिए रिव फाइलों की प्रतिकृति बनाने से बचें। रिव एनिमेशन में सीधे रंग परिवर्तन लागू करने के लिए रिवरेंडरऑब्जेक्ट का उपयोग करना।';

  @override
  String get cinemapediaName => 'सिनेमापीडिया';

  @override
  String get cinemapediaProjectDescription =>
      'सिनेमापीडिया एक एप्लिकेशन है जो फ्लटर और TheMovieDB API का उपयोग करके विकसित किया गया है, जो उपयोगकर्ताओं को मौजूदा फिल्मों, आगामी रिलीज़ और सबसे लोकप्रिय फिल्मों के बारे में विस्तृत जानकारी का पता लगाने के लिए एक मंच प्रदान करता है। ऐप उपयोगकर्ताओं को फिल्मों को पसंदीदा के रूप में चिह्नित करने, ट्रेलर देखने, कलाकारों के बारे में जानने और नाम, शैली या कीवर्ड द्वारा खोज करने की अनुमति देता है। यह अभिनेताओं, फिल्म श्रेणियों, और मूवी रेटिंग्स के बारे में भी जानकारी प्रदान करता है, जिससे उपयोगकर्ताओं को सिनेमा के साथ उनकी बातचीत में एक व्यापक और समृद्ध अनुभव मिलता है।';

  @override
  String get frescomaxName => 'फ्रेस्कोमैक्स';

  @override
  String get frescomaxRole => 'फुल स्टैक और क्लाउड इंजीनियर';

  @override
  String get frescomaxTimelapse => '2025 - वर्तमान';

  @override
  String get frescomaxExperienceDescription =>
      'एकमात्र डेवलपर (Solo Developer) के रूप में, मैंने पूरे इकोसिस्टम को शून्य से बनाया। मैंने एप्लिकेशन (Flutter) और बैकएंड (API) दोनों विकसित किए। वीडियो स्ट्रीमिंग के लिए Elastic Beanstalk, S3 और CloudFront का उपयोग करके AWS पर इंफ्रास्ट्रक्चर डिज़ाइन और तैनात किया। Riverpod के साथ Clean Architecture लागू किया, जिससे iOS, Android और Web पर एक स्केलेबल और उच्च-प्रदर्शन वाला उत्पाद सुनिश्चित हुआ।';

  @override
  String get frescomaxProjectDescription =>
      'फ्रेस्कोमैक्स एक क्रॉस-प्लेटफ़ॉर्म ऐप (iOS, Android, Web) है जो प्रशंसकों के लिए एक इंटरैक्टिव कैटलॉग और विज़ुअलाइज़ेशन टूल के रूप में कार्य करता है। इसमें एक विस्तृत उत्पाद कैटलॉग, रीयल-टाइम रंग चयन के साथ उन्नत अनुकूलन, और वास्तविक स्थानों में प्रशंसकों की कल्पना करने के लिए एक AR-जैसा वर्चुअल असेंबली टूल है। Flutter और Clean Architecture के साथ निर्मित, यह सहज एनिमेशन और उत्तरदायी डिज़ाइन के साथ एक प्रीमियम उपयोगकर्ता अनुभव सुनिश्चित करता है।';

  @override
  String get contactDescription =>
      'यदि आप मेरे बारे में अधिक जानना चाहते हैं, मेरे काम के बारे में, या बस चैट करना चाहते हैं, तो मुझसे संपर्क करने में संकोच न करें। मैं हमेशा नए अवसरों और सहयोगों के लिए खुला हूँ।';

  @override
  String get licenseButtonLabel => 'लाइसेंस';

  @override
  String get goToTopButtonLabel => 'ऊपर जाएँ';

  @override
  String get goToWebsiteButtonLabel => 'वेबसाइट पर जाएं';

  @override
  String get lifePolicies => 'जीवन पॉलिसियां';

  @override
  String get footerPhrasePart1 => 'के साथनिर्मित';

  @override
  String get footerPhrasePart2 => 'डोमिनिकन गणराज्य से';
}
