Repository: JSimonDev/jsimon-portfolio
Catalog: lib/l10n/app_*.arb
Languages: es, hi, zh

# name
source: Jonathan Simon
hi: जोनाथन साइमन
zh: 乔纳森·西蒙

# roleLarge
source: Software Developer | Tech Enthusiast
es: Desarrollador de Software
hi: सॉफ्टवेयर डेवलपर | टेक एन्थुसियास्ट
zh: 软件开发者 | 技术爱好者

# roleSmall
source: Software Developer
es: Desarrollador de Software
hi: सॉफ्टवेयर डेवलपर
zh: 软件开发者

# phrase
source: Welcome to my digital garden 🌱, a space where I cultivate and share my discoveries about developing exceptional products, continually refining myself as a developer, and evolving my career in the vast world of technology.
es: Bienvenido a mi jardín digital 🌱, un espacio donde cultivo y comparto mis descubrimientos sobre el desarrollo de productos excepcionales, refinándome continuamente como desarrollador y evolucionando mi carrera en el vasto mundo de la tecnología.
hi: मेरे डिजिटल गार्डन 🌱 में आपका स्वागत है, एक ऐसी जगह जहाँ मैं उत्कृष्ट उत्पादों के विकास के बारे में अपनी खोजों को संवारता और साझा करता हूँ, लगातार खुद को एक डेवलपर के रूप में परिष्कृत करता हूँ, और तकनीक की विशाल दुनिया में अपने करियर को विकसित करता हूँ।
zh: 欢迎来到我的数字花园🌱，这是一个我培养和分享我对开发卓越产品的发现、不断精进作为一个开发者的自我、以及在广阔的技术世界中演变我的职业生涯的空间。

# contactButtonLabel
source: Contact
es: Contáctame
hi: संपर्क करें
zh: 联系

# expirienceTitle
source: Experience
es: Experiencia
hi: अनुभव
zh: 经验

# projectsTitle
source: Projects
es: Proyectos
hi: परियोजनाएं
zh: 项目

# technologiesTitle
source: Technologies I have worked with
es: Tecnologías con las que he trabajado
hi: तकनीकें जिनके साथ मैंने काम किया है
zh: 我曾工作过的技术

# contactTitle
source: Contact Me
es: Contáctame
hi: मुझसे संपर्क करें
zh: 联系我

# cotizameName
source: Cotízame
hi: कोटिज़मे

# cotizameRole
source: Mobile Developer (Flutter)
es: Desarrollador Móvil (Flutter)
hi: मोबाइल डेवलपर (फ्लटर)
zh: 移动开发者 (Flutter)

# cotizameTimelapse
source: 2023 - Present
es: 2023 - Presente
hi: 2023 - वर्तमान
zh: 2023 - 现在

# cotizameExperienceDescription
source: In the development of "Cotízame", an innovative mobile application that facilitates interaction between buyers and sellers through direct quotation requests, I lead the creation of the user interface and design, using Flutter. My role is fundamental in the conceptualization and execution of an intuitive user experience, significantly contributing to the distinctive character and usability of the application. This project has been an excellent opportunity to delve deeper into Flutter and Dart, strengthening my skills in interface design and collaboration to deliver a revolutionary market solution.
es: En el desarrollo de "Cotízame", una aplicación móvil innovadora que facilita la interacción entre compradores y vendedores a través de solicitudes de cotización directa, lidero la creación de la interfaz de usuario y el diseño, utilizando Flutter. Mi rol es fundamental en la conceptualización y ejecución de una experiencia de usuario intuitiva, contribuyendo significativamente al carácter distintivo y la usabilidad de la aplicación. Este proyecto ha sido una excelente oportunidad para profundizar en Flutter y Dart, fortaleciendo mis habilidades en diseño de interfaces y colaboración para entregar una solución de mercado revolucionaria.
hi: "कोटिज़मे" के विकास में, एक नवीन मोबाइल एप्लिकेशन जो खरीदारों और विक्रेताओं के बीच सीधे कोटेशन अनुरोधों के माध्यम से इंटरेक्शन को सुविधाजनक बनाता है, मैंने उपयोगकर्ता इंटरफेस और डिज़ाइन के निर्माण का नेतृत्व किया, फ्लटर का उपयोग करते हुए। मेरी भूमिका एक सहज उपयोगकर्ता अनुभव की अवधारणा और कार्यान्वयन में मौलिक है, जो एप्लिकेशन के विशिष्ट चरित्र और उपयोगिता में काफी योगदान देती है। यह परियोजना फ्लटर और डार्ट में गहराई से उतरने का एक उत्कृष्ट अवसर रही है, इंटरफेस डिज़ाइन और सहयोग में मेरे कौशल को मजबूत करते हुए एक क्रांतिकारी बाज़ार समाधान देने के लिए।
zh: 在开发“Cotízame”这一创新的移动应用过程中，该应用促进了买家和卖家通过直接报价请求进行互动，我主导了用户界面和设计的创建，使用Flutter。我的角色在概念化和执行直观用户体验方面至关重要，显著地贡献了该应用的独特性格和可用性。这个项目是深入研究Flutter和Dart的绝佳机会，加强了我在界面设计和合作方面的技能，以交付一种革命性的市场解决方案。

# cotizameProjectDescription
source: Cotízame is an innovative mobile application designed in Flutter, specifically aimed, though not exclusively, at the population of the Dominican Republic. Cotizame revolutionizes the way buyers and sellers interact, giving the buyer a more active role in the purchasing process. Through this application, users can draft and send detailed quotation requests specifying the desired product or service and the price they are willing to pay. These requests are sent directly to selected sellers, who can respond with personalized offers. Upon accepting an offer, a purchase order is automatically generated, initiating the payment and delivery process. Cotizame stands out for its modern and user-friendly interface, facilitating intuitive navigation and efficient processing of quotation requests, all within a fast and accessible mobile environment.
es: Cotízame es una aplicación móvil innovadora diseñada en Flutter, dirigida específicamente, aunque no exclusivamente, a la población de la República Dominicana. Cotízame revoluciona la forma en que compradores y vendedores interactúan, otorgando al comprador un rol más activo en el proceso de compra. A través de esta aplicación, los usuarios pueden redactar y enviar solicitudes de cotización detalladas especificando el producto o servicio deseado y el precio que están dispuestos a pagar. Estas solicitudes se envían directamente a los vendedores seleccionados, quienes pueden responder con ofertas personalizadas. Al aceptar una oferta, se genera automáticamente una orden de compra, iniciando el proceso de pago y entrega. Cotízame se destaca por su interfaz moderna y amigable con el usuario, facilitando una navegación intuitiva y un procesamiento eficiente de las solicitudes de cotización, todo dentro de un entorno móvil rápido y accesible.
hi: कोटिज़मे एक नवीन मोबाइल एप्लिकेशन है जिसे फ्लटर में डिज़ाइन किया गया है, विशेष रूप से लेकिन विशेष रूप से नहीं, डोमिनिकन गणराज्य की आबादी के लिए। कोटिज़मे खरीदारों और विक्रेताओं के बीच बातचीत के तरीके को क्रांतिकारी बनाता है, खरीदार को खरीद प्रक्रिया में अधिक सक्रिय भूमिका देता है। इस एप्लिकेशन के माध्यम से, उपयोगकर्ता विस्तृत कोटेशन अनुरोध तैयार कर सकते हैं जिसमें वांछित उत्पाद या सेवा और वे भुगतान करने को तैयार हैं उस कीमत को निर्दिष्ट करते हैं। ये अनुरोध सीधे चयनित विक्रेताओं को भेजे जाते हैं, जो व्यक्तिगत प्रस्तावों के साथ प्रतिक्रिया दे सकते हैं। एक प्रस्ताव स्वीकार करने पर, एक खरीद आदेश स्वचालित रूप से उत्पन्न होता है, जिससे भुगतान और वितरण प्रक्रिया शुरू होती है। कोटिज़मे अपने आधुनिक और उपयोगकर्ता-मित्रवत इंटरफेस के लिए प्रमुख है, जो त्वरित और सुलभ मोबाइल वातावरण में कोटेशन अनुरोधों की कुशल प्रक्रिया और सहज नेविगेशन की सुविधा प्रदान करता है।
zh: Cotízame是一款在Flutter中设计的创新移动应用，特别针对（但不仅限于）多米尼加共和国的人群。Cotizame彻底改变了买家和卖家的互动方式，赋予买家在购买过程中更主动的角色。通过这个应用，用户可以起草并发送详细的报价请求，指定所需的产品或服务以及他们愿意支付的价格。这些请求直接发送给选定的卖家，卖家可以回应个性化的报价。接受报价后，自动生成采购订单，启动支付和交付过程。Cotizame以其现代且用户友好的界面脱颖而出，提供直观的导航和高效的报价请求处理，全部在一个快速且易于访问的移动环境中。

# freelanceName
source: Freelance
hi: फ्रीलांस
zh: 自由职业

# freelanceRole
source: Web Developer / Mobile Developer (Ionic, Flutter)
es: Desarrollador Web / Desarrollador Móvil (Ionic, Flutter)
hi: वेब डेवलपर / मोबाइल डेवलपर (Ionic, Flutter)
zh: 网页开发者 / 移动开发者 (Ionic, Flutter)

# freelanceExperienceDescription
source: Personal projects and freelance work have been key in expanding development and design skills, facilitating the exploration of innovative solutions independently. These experiences have reinforced the ability to manage projects and solve technical challenges with creativity, without relying on traditional structures.
es: Los proyectos personales y el trabajo como freelancer han sido clave para expandir habilidades de desarrollo y diseño, facilitando la exploración de soluciones innovadoras de manera independiente. Estas experiencias han reforzado la capacidad de gestionar proyectos y resolver desafíos técnicos con creatividad, sin depender de estructuras tradicionales.
hi: व्यक्तिगत परियोजनाओं और फ्रीलांस कार्य विकास और डिज़ाइन कौशल को विस्तारित करने में महत्वपूर्ण रहे हैं, जिससे स्वतंत्र रूप से नवीन समाधानों की खोज करने की क्षमता में सुविधा मिली है। ये अनुभव परंपरागत संरचनाओं पर निर्भर नहीं करते हुए परियोजनाओं को प्रबंधित करने और तकनीकी चुनौतियों को सृजनात्मकता से हल करने की क्षमता को मजबूत करते हैं।
zh: 个人项目和自由职业工作在扩展开发和设计技能方面至关重要，它们促进了独立探索创新解决方案的能力。这些经历加强了在没有依赖传统结构的情况下管理项目和解决技术挑战的能力。

# riveColorModifierProjectName
source: Rive Color Modifier
hi: रिव कलर मॉडिफायर
zh: Rive 色彩调整器

# riveColorModifierProjectDescription
source: Rive Color Modifier is a Flutter package that allows you to dynamically modify the colors of your Rive animations. If you work with animations in your application, this package can be a valuable tool for adjusting colors in real time. Here are the key details about the package: - Usage: To use Rive Color Modifier, simply add the dependency to your `pubspec.yaml` file. Then, in your code, you can create instances of `RiveColorModifier` and apply color changes to your Rive animations. - Benefits: 1. Flexibility: Modify animation colors without altering the original Rive files. 2. Interactivity: Adjust colors in real time, useful for customizable themes or dynamic animations. 3. Optimization: Avoid duplicating Rive files just to change colors. Making use of RiveRenderObject to apply color changes directly to the Rive animation.
es: Rive Color Modifier es un paquete de Flutter que te permite modificar dinámicamente los colores de tus animaciones Rive. Si trabajas con animaciones en tu aplicación, este paquete puede ser una herramienta valiosa para ajustar colores en tiempo real. Aquí están los detalles clave sobre el paquete: - Uso: Para usar Rive Color Modifier, simplemente agrega la dependencia a tu archivo pubspec.yaml. Luego, en tu código, puedes crear instancias de RiveColorModifier y aplicar cambios de color a tus animaciones Rive. - Beneficios: 1. Flexibilidad: Modifica los colores de las animaciones sin alterar los archivos Rive originales. 2. Interactividad: Ajusta los colores en tiempo real, útil para temas personalizables o animaciones dinámicas. 3. Optimización: Evita duplicar archivos Rive solo para cambiar colores. Haciendo uso de RiveRenderObject para aplicar cambios de color directamente en la animación Rive.
hi: रिव कलर मॉडिफायर एक फ्लटर पैकेज है जो आपको अपने रिव एनिमेशन के रंगों को गतिशील रूप से संशोधित करने की अनुमति देता है। यदि आप अपने एप्लिकेशन में एनिमेशन के साथ काम करते हैं, तो यह पैकेज वास्तविक समय में रंगों को समायोजित करने के लिए एक मूल्यवान उपकरण हो सकता है। पैकेज के बारे में मुख्य विवरण यहाँ दिए गए हैं: - उपयोग: रिव कलर मॉडिफायर का उपयोग करने के लिए, बस अपनी `pubspec.yaml` फाइल में निर्भरता जोड़ें। फिर, अपने कोड में, आप `RiveColorModifier` के उदाहरण बना सकते हैं और अपने रिव एनिमेशन में रंग परिवर्तन लागू कर सकते हैं। - लाभ: 1. लचीलापन: मूल रिव फाइलों को बदले बिना एनिमेशन रंगों को संशोधित करना। 2. इंटरएक्टिविटी: वास्तविक समय में रंगों को समायोजित करना, अनुकूलनीय थीम या गतिशील एनिमेशन के लिए उपयोगी। 3. अनुकूलन: बस रंग बदलने के लिए रिव फाइलों की प्रतिकृति बनाने से बचें। रिव एनिमेशन में सीधे रंग परिवर्तन लागू करने के लिए रिवरेंडरऑब्जेक्ट का उपयोग करना।
zh: Rive 色彩调整器是一个Flutter包，允许您动态修改Rive动画的颜色。如果您在应用中使用动画，这个包可以是一个调整颜色的有价值的工具。 关于包的关键详情： - 使用：要使用Rive色彩调整器，只需将依赖添加到您的`pubspec.yaml`文件中。然后，在代码中，您可以创建`RiveColorModifier`的实例并应用颜色更改到您的Rive动画。 - 好处： 1. 灵活性：不改变原始Rive文件的情况下修改动画颜色。 2. 互动性：实时调整颜色，适用于可定制主题或动态动画。 3. 优化：避免仅为更改颜色而复制Rive文件。使用RiveRenderObject直接应用颜色更改到Rive动画。

# cinemapediaName
source: Cinemapedia
hi: सिनेमापीडिया

# cinemapediaProjectDescription
source: Cinemapedia is an application developed using Flutter and TheMovieDB API, providing users with a platform to explore detailed information about current movies, upcoming releases, and the most popular ones. The app allows users to mark movies as favorites, view trailers, learn about the cast, and perform searches by name, genre, or keywords. It also offers information on actors, film categories, and movie ratings, enabling users to have a comprehensive and enriching experience in their engagement with cinema.
es: Cinemapedia es una aplicación desarrollada utilizando Flutter y la API de TheMovieDB, brindando a los usuarios una plataforma para explorar información detallada sobre películas actuales, próximos estrenos y las más populares. La aplicación permite a los usuarios marcar películas como favoritas, ver tráileres, conocer sobre el elenco y realizar búsquedas por nombre, género o palabras clave. También ofrece información sobre actores, categorías de películas y calificaciones de películas, permitiendo a los usuarios tener una experiencia comprensiva y enriquecedora en su interacción con el cine.
hi: सिनेमापीडिया एक एप्लिकेशन है जो फ्लटर और TheMovieDB API का उपयोग करके विकसित किया गया है, जो उपयोगकर्ताओं को मौजूदा फिल्मों, आगामी रिलीज़ और सबसे लोकप्रिय फिल्मों के बारे में विस्तृत जानकारी का पता लगाने के लिए एक मंच प्रदान करता है। ऐप उपयोगकर्ताओं को फिल्मों को पसंदीदा के रूप में चिह्नित करने, ट्रेलर देखने, कलाकारों के बारे में जानने और नाम, शैली या कीवर्ड द्वारा खोज करने की अनुमति देता है। यह अभिनेताओं, फिल्म श्रेणियों, और मूवी रेटिंग्स के बारे में भी जानकारी प्रदान करता है, जिससे उपयोगकर्ताओं को सिनेमा के साथ उनकी बातचीत में एक व्यापक और समृद्ध अनुभव मिलता है।
zh: Cinemapedia是一个使用Flutter和TheMovieDB API开发的应用，为用户提供一个平台，探索关于当前电影、即将上映的影片和最受欢迎的电影的详细信息。应用允许用户将电影标记为最爱，观看预告片，了解演员阵容，并通过名称、类型或关键词执行搜索。它还提供有关演员、电影类别和电影评级的信息，使用户在与电影的互动中拥有全面且丰富的体验。

# frescomaxName
source: Frescomax
hi: फ्रेस्कोमैक्स

# frescomaxRole
source: Full Stack & Cloud Engineer
es: Ingeniero Full Stack & Cloud
hi: फुल स्टैक और क्लाउड इंजीनियर

# frescomaxTimelapse
source: 2025 - Present
es: 2025 - Presente
hi: 2025 - वर्तमान

# frescomaxExperienceDescription
source: As the sole developer, I built the entire ecosystem from scratch. I developed both the application (Flutter) and the Backend (API). Designed and deployed the infrastructure on AWS using Elastic Beanstalk, S3, and CloudFront for video streaming. Implemented Clean Architecture with Riverpod, ensuring a scalable and high-performance product on iOS, Android, and Web.
es: Como desarrollador único (Solo Developer), construí todo el ecosistema desde cero. Desarrollé tanto la aplicación (Flutter) como el Backend (API). Diseñé y desplegué la infraestructura en AWS utilizando Elastic Beanstalk, S3 y CloudFront para streaming de video. Implementé Clean Architecture con Riverpod, garantizando un producto escalable y de alto rendimiento en iOS, Android y Web.
hi: एकमात्र डेवलपर (Solo Developer) के रूप में, मैंने पूरे इकोसिस्टम को शून्य से बनाया। मैंने एप्लिकेशन (Flutter) और बैकएंड (API) दोनों विकसित किए। वीडियो स्ट्रीमिंग के लिए Elastic Beanstalk, S3 और CloudFront का उपयोग करके AWS पर इंफ्रास्ट्रक्चर डिज़ाइन और तैनात किया। Riverpod के साथ Clean Architecture लागू किया, जिससे iOS, Android और Web पर एक स्केलेबल और उच्च-प्रदर्शन वाला उत्पाद सुनिश्चित हुआ।

# frescomaxProjectDescription
source: Frescomax is a cross-platform app (iOS, Android, Web) that serves as an interactive catalog and visualization tool for fans. It features a detailed product catalog, advanced customization with real-time color selection, and an AR-like virtual assembly tool to visualize fans in real spaces. Built with Flutter and Clean Architecture, it ensures a premium user experience with smooth animations and a responsive design.
es: Frescomax es una aplicación multiplataforma (iOS, Android, Web) que funciona como catálogo interactivo y herramienta de visualización de ventiladores. Cuenta con un catálogo detallado, personalización avanzada con selección de colores en tiempo real y una herramienta de montaje virtual (tipo AR) para visualizar ventiladores en espacios reales. Construida con Flutter y Clean Architecture, garantiza una experiencia de usuario premium con animaciones fluidas y diseño responsive.
hi: फ्रेस्कोमैक्स एक क्रॉस-प्लेटफ़ॉर्म ऐप (iOS, Android, Web) है जो प्रशंसकों के लिए एक इंटरैक्टिव कैटलॉग और विज़ुअलाइज़ेशन टूल के रूप में कार्य करता है। इसमें एक विस्तृत उत्पाद कैटलॉग, रीयल-टाइम रंग चयन के साथ उन्नत अनुकूलन, और वास्तविक स्थानों में प्रशंसकों की कल्पना करने के लिए एक AR-जैसा वर्चुअल असेंबली टूल है। Flutter और Clean Architecture के साथ निर्मित, यह सहज एनिमेशन और उत्तरदायी डिज़ाइन के साथ एक प्रीमियम उपयोगकर्ता अनुभव सुनिश्चित करता है।

# contactDescription
source: If you want to know more about me, my work, or just want to chat, don't hesitate to contact me. I'm always open to new opportunities and collaborations.
es: Si quieres saber más sobre mí, mi trabajo o simplemente quieres charlar, no dudes en contactarme. Siempre estoy abierto a nuevas oportunidades y colaboraciones.
hi: यदि आप मेरे बारे में अधिक जानना चाहते हैं, मेरे काम के बारे में, या बस चैट करना चाहते हैं, तो मुझसे संपर्क करने में संकोच न करें। मैं हमेशा नए अवसरों और सहयोगों के लिए खुला हूँ।
zh: 如果您想了解更多关于我、我的工作，或只是想聊天，请随时联系我。我始终对新的机会和合作持开放态度。

# licenseButtonLabel
source: Licenses
es: Licencias
hi: लाइसेंस
zh: 许可

# goToTopButtonLabel
source: Go to top
es: Ir arriba
hi: ऊपर जाएँ
zh: 回到顶部

# goToWebsiteButtonLabel
source: Go to website
es: Ir al sitio web
hi: वेबसाइट पर जाएं
zh: 前往网站

source: Life Policies
es: Políticas de Vida
hi: जीवन पॉलिसियां
zh: 人寿保险政策

# footerPhrasePart1
source: Made with
es: Hecho con
hi: के साथनिर्मित
zh: 用心制作

# footerPhrasePart2
source: from Dominican Republic
es: desde República Dominicana
hi: डोमिनिकन गणराज्य से
zh: 由JSimonDev
